sphere-porousSimpleFoam/0_orig/k
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  2.3.0                                 |
|   \\  /    A nd           | Web:      www.OpenFOAM.org                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    object      k;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 2 -2 0 0 0 0];

internalField   uniform 1.0;

boundaryField
{

    xmin
    {
        type            freestream;
        freestreamValue uniform 1.0;
    }
    xmax
    {
        type            freestream;
        freestreamValue uniform 1.0;
    }
    ymin
    {
        type            freestream;
        freestreamValue uniform 1.0;
    }
    ymax
    {
        type            freestream;
        freestreamValue uniform 1.0;
    }
    zmin
    {
        type            freestream;
        freestreamValue uniform 1.0;
    }
    zmax
    {
        type            freestream;
        freestreamValue uniform 1.0;
    }

    sphere
    {
        type            kqRWallFunction;
        value           uniform 1.0;
    }

}

// ************************************************************************* //
